Repository: pingfangx/TranslatorX-other
Catalog: GitDocs/omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: If stdout-is-tty is missing, then checks the standard output of the command itself, and exits with status 0 if color is to be used, or exits with status 1 otherwise.
zh_cn: 如果缺少 stdout-is-tty ，则检查命令本身的标准输出，如果要使用颜色则退出状态0，否则退出状态1。

source: If master did not exist remotely, it would be created.
zh_cn: 如果 master 在远程不存在，那么它将被创建。

source: If <commit> on one side is omitted, it will have the same effect as using HEAD instead.
zh_cn: 如果忽略一方面的 <commit>，则与使用 HEAD 的效果相同。

source: If <mode> is omitted, defaults to "--mixed".
zh_cn: 如果省略<mode>，则默认为"--mixed"。

source: If <newbranch> exists, -M must be used to force the rename to happen.
zh_cn: 如果 <newbranch> 存在，则必须使用 -M 强制重命名。

source: If <oldbranch> had a corresponding reflog, it is renamed to match <newbranch>, and a reflog entry is created to remember the branch renaming.
zh_cn: 如果<oldbranch>具有相应的 reflog，则将其重命名为匹配<newbranch>，并创建一个 reflog 条目来记住分支重命名。

source: If <prefix> is specified it is prepended to the filenames in the archive.
zh_cn: 如果指定了<prefix>，那么它将作为存档文件中的文件名。

source: If <upstream> is not specified, the upstream configured in branch.<name>.remote and branch.<name>.merge options will be used (see git-config[1] for details) and the --fork-point option is assumed.
zh_cn: 如果未指定 <upstream>，则配置在 branch.<name>.remote 和 branch.<name>.merge 选项(详见 git-config[1] ) 中的 upstream 将被使用，并假定 --fork-point 选项。

source: If HEAD does not exist (e.g. unborn branches) and <commit> is not given, it shows all staged changes.
zh_cn: 如果 HEAD 不存在(例如未出生的分支)，并且未提供<commit>，则显示所有暂存更改。

source: If a <pattern> is given, it is used as a shell wildcard to restrict the output to matching branches.
zh_cn: 如果给出了一个 <pattern> ，它将被用作一个 shell 通配符，将输出限制为匹配的分支。

source: If a Git command is named this option will bring up the manual page for that command.
zh_cn: 如果指定一个 Git 命令，此选项将显示该命令的手册页。

source: If a command, or a guide, is given, a manual page for that command or guide is brought up.
zh_cn: 如果给出了命令或指南，则会给出该命令或指南的手册页。

source: If a file that is different between <commit> and HEAD has local changes, reset is aborted.
zh_cn: 如果在<commit>和 HEAD 之间不同的文件有本地更改，则重置将中止。

source: If a file that is different between <commit> and the index has unstaged changes, reset is aborted.
zh_cn: 如果<commit>与索引之间的文件有不同的更改，则重置将中止。

source: If all you really want to do is to remove from the index the files that are no longer present in the working tree (perhaps because your working tree is dirty so that you cannot use git commit -a), use the following command:
zh_cn: 如果您真正想要做的是将不再存在于工作树中的文件从索引中移除(可能是因为您的工作树脏了，因此您不能使用 git commit -a )，使用以下命令：

source: If an untracked directory is managed by a different Git repository, it is not removed by default.
zh_cn: 如果未跟踪的目录由不同的 Git 存储库管理，则默认情况下不会删除它。

source: If any ignored files were explicitly specified on the command line, git add will fail with a list of ignored files.
zh_cn: 如果在命令行上明确指定了任何被忽略的文件，那么 git add 将会失败并列出被忽略的文件。

source: If any optional <path>... arguments are given, only those paths are affected.
zh_cn: 如果给出任何可选的 <path>... 参数，则只会影响这些路径。

source: If either --textconv or --filters was specified, the input is expected to list the object names followed by the path name, separated by a single white space, so that the appropriate drivers can be determined.
zh_cn: 如果指定 --textconv 或 --filters ，则输入需要列出对象名称，后跟路径名称，以单个空格分隔，以便可以确定适当的驱动程序。

source: If either of these environment variables is set then git fetch and git push will use the specified command instead of ssh when they need to connect to a remote system.
zh_cn: 如果这些环境变量中的任何一个被设置，那么当需要连接到某个环境变量时， git fetch 和 git push 将使用指定的命令而不是 ssh 。

source: If fetching to a shallow repository created by git clone with --depth=<depth> option (see git-clone[1]), deepen or shorten the history to the specified number of commits.
zh_cn: 如果抓取一个通过 --depth=<depth> 选项创建的 shallow 仓库(见 git-clone[1] )，将历史加深或缩短到指定数量的提交。

source: If history is linear and HEAD is an ancestor of next, update the working tree and advance the HEAD pointer to match next.
zh_cn: 如果历史是线性的，HEAD 是 next 的祖先，则更新工作树，然后将 HEAD 指针前进以匹配到 next 。

source: If it is set to an empty string or to the value "cat", Git will not launch a pager.
zh_cn: 如果设置为空字符串或值"cat"，Git 将不会启动 pager。

source: If multiple -m options are given, their values are concatenated as separate paragraphs.
zh_cn: 如果给出了多个 -m 选项，则它们的值将连接为单独的段落。

source: If multiple patterns are given, a branch is shown if it matches any of the patterns.
zh_cn: 如果给出多个模式，如果匹配任何模式，则显示分支。

source: If no <file> names are specified, git mergetool will run the merge tool program on every file with merge conflicts.
zh_cn: 如果没有指定<file>名称，则 git mergetool 将在具有合并冲突的每个文件上运行合并工具程序。

source: If no <pathspec> is given when -A option is used, all files in the entire working tree are updated (old versions of Git used to limit the update to the current directory and its subdirectories).
zh_cn: 如果在使用 -A 选项时未指定<pathspec>，则会更新整个工作树中的所有文件(旧版本的 Git 用于限制更新到当前目录及其子目录)。

source: If no <pathspec> is given when -u option is used, all tracked files in the entire working tree are updated (old versions of Git used to limit the update to the current directory and its subdirectories).
zh_cn: 如果在使用 -u 选项时未指定<pathspec>，则会更新整个工作树中的所有跟踪文件(用于限制更新到当前目录及其子目录的 Git 旧版本)。

source: If no format is given, implies the --porcelain output format.
zh_cn: 如果没有格式，则表示 --porcelain 输出格式。

source: If no further options are given, all reading options will read all of these files that are available.
zh_cn: 如果没有进一步的选项，所有阅读选项将会读取所有可用的文件。

source: If no number is given to -n, only the first line is printed.
zh_cn: 如果没有数字被赋予 -n ，则只打印第一行。

source: If no objects are given, git fsck defaults to using the index file, all SHA-1 references in refs namespace, and all reflogs (unless --no-reflogs is given) as heads.
zh_cn: 如果没有给出任何对象，则 git fsck 默认使用索引文件， refs 命名空间中的所有 SHA-1 引用和所有 reflogs (除非--no-reflogs 被给出)作为头。

source: If no path is given, git will print the current setting and then exit.
zh_cn: 如果没有给出路径， git 将打印当前设置，然后退出。

source: If no paths are given, git checkout will also update HEAD to set the specified branch as the current branch.
zh_cn: 如果没有给出路径，则 git checkout 也会更新 HEAD ，将指定的分支设置为当前分支。

source: If no revisions are passed on the command line and either standard input is not a terminal or there is no current branch, git shortlog will output a summary of the log read from standard input, without reference to the current repository.
zh_cn: 如果在命令行上没有传递任何修订版本，并且标准输入不是终端或没有当前分支，则 git shortlog 将输出从标准输入读取的日志的摘要，而不引用当前库。

source: If no type specifier is passed, no checks or transformations are performed on the value.
zh_cn: 如果没有类型说明符传递，则不会对该值执行检查或转换。

source: If none of these config variables is set, the git web{litdd}browse helper script (called by git help) will pick a suitable default.
zh_cn: 如果没有设置这些配置变量，则 git web{litdd}browse 帮助脚本(由 git help 调用)将选择合适的默认值。

source: If not set explicitly with --file, there are four files where git config will search for configuration options:
zh_cn: 如果没有使用 --file 显式设置，git config 将在四个文件中搜索配置选项：

source: If not specified, the default of $GIT_DIR/index is used.
zh_cn: 如果未指定，则使用默认值 $GIT_DIR/index 。

source: If not specified, the index will be used.
zh_cn: 如果未指定，将使用索引。

source: If one of -a, -s, or -u <keyid> is passed, the command creates a tag object, and requires a tag message.
zh_cn: 如果传递 -a ， -s 或 -u <keyid> 之一，则该命令将创建一个 tag 对象，并且需要一个标签消息。

source: If one or more <file> parameters are given, the merge tool program will be run to resolve differences on each file (skipping those without conflicts).
zh_cn: 如果给出一个或多个<file>参数，则将运行合并工具程序来解决每个文件的差异(跳过那些没有冲突的文件)。

source: If set to "error", print the warnings and stop the rebase.
zh_cn: 如果设置为"error"，请打印警告并停止 rebase。

source: If set to "ignore", no checking is done.
zh_cn: 如果设置为"ignore"，则不进行任何检查。

source: If set to "warn", print warnings about removed commits in interactive mode.
zh_cn: 如果设置为"warn"，则以交互模式打印关于删除的提交的警告。

source: If set to 1, include broken or badly named refs when iterating over lists of refs.
zh_cn: 如果设置为 1 ，则在迭代引用列表时包括损坏的或命名错误的引用。

source: If set to a colon-separated list of protocols, behave as if protocol.allow is set to never, and each of the listed protocols has protocol.<name>.allow set to always (overriding any existing configuration).
zh_cn: 如果设置为冒号分隔的协议列表，就像 protocol.allow 设置为never一样，每个列出的协议都有 protocol.<name>.allow 设置为 always (覆盖任何已存在的设置).

source: If set to true enable --autosquash option by default.
zh_cn: 如果设置为 true，则默认启用 --autosquash 选项。

source: If set to true enable --autostash option by default.
zh_cn: 如果设置为 true，则默认启用 --autostash 选项。

source: If set, it is a list of directories that Git should not chdir up into while looking for a repository directory (useful for excluding slow-loading network directories).
zh_cn: 如果设置，它是 Git 在查找仓库目录时不应该进入的目录列表(用于排除缓慢加载的网络目录)。

source: If some files could not be added because of errors indexing them, do not abort the operation, but continue adding the others.
zh_cn: 如果某些文件因为索引错误而无法添加，则不要中止操作，而是继续添加其他文件。

source: If specified twice, show in addition the unified diff between what would be committed and the worktree files, i.e. the unstaged changes to tracked files.
zh_cn: 如果指定两次，则另外显示将提交的内容与工作树文件之间的统一差异，即对跟踪文件的未更改的更改。

source: If the --onto option is not specified, the starting point is <upstream>.
zh_cn: 如果未指定--onto 选项，则起始点为<upstream>。

source: If the $GIT_DIR environment variable is set then it specifies a path to use instead of ./.git for the base of the repository.
zh_cn: 如果设置了 $GIT_DIR 环境变量，那么它将为存储库的基础指定使用的路径而不是 ./.git 。

source: If the GIT_DIR environment variable is set then it specifies a path to use instead of the default .git for the base of the repository.
zh_cn: 如果设置了 GIT_DIR 环境变量，那么它将为仓库的基础指定一个使用的路径而不是缺省的 .git 。

source: If the <commit> argument is missing it defaults to HEAD (i.e. the tip of the current branch).
zh_cn: 如果缺少<commit>参数，则默认为 HEAD (即当前分支的尖端)。

source: If the Git configuration variable clean.requireForce is not set to false, git clean will refuse to delete files or directories unless given -f, -n or -i.
zh_cn: 如果 Git 配置变量 clean.requireForce 未设置为 false，则除非 -f，-n 或 -i，否则 git clean 将拒绝删除文件或目录。

source: If the HEAD at the remote did not point at any branch when --single-branch clone was made, no remote-tracking branch is created.
zh_cn: 如果远程的 HEAD 在 --single-branch 克隆时没有指向任何分支，则不会创建远程跟踪分支。

source: If the branch currently has a reflog then the reflog will also be deleted.
zh_cn: 如果分支目前有一个 reflog，那么 reflog 也将被删除。

source: If the commit is a merge, and if the pretty-format is not oneline, email or raw, an additional line is inserted before the Author: line.
zh_cn: 如果提交是合并的，并且如果美化格式不是 oneline ， email 或 raw ，则在Author:行之前会有额外的行。

source: If the configuration is missing, it defaults to origin.
zh_cn: 如果配置丢失，则默认为 origin 。

source: If the global or the system-wide configuration file are not available they will be ignored.
zh_cn: 如果全局或全系统配置文件不可用，它们将被忽略。

source: If the number of loose objects exceeds the value of the gc.auto configuration variable, then all loose objects are combined into a single pack using git repack -d -l.
zh_cn: 如果松散对象的数量超过了 gc.auto 配置变量的值，则使用 git repack -d -l 将所有松散的对象组合成单个包。

source: If the number of packs exceeds the value of gc.autoPackLimit, then existing packs (except those marked with a .keep file) are consolidated into a single pack by using the -A option of git repack.
zh_cn: 如果包数超过了 gc.autoPackLimit 的值，那么现有的包(除了标有 .keep 文件的包)被合并成一个包，使用 git repack 的 -A 选项。

source: If the object storage directory is specified via the $GIT_OBJECT_DIRECTORY environment variable then the sha1 directories are created underneath - otherwise the default $GIT_DIR/objects directory is used.
zh_cn: 如果通过 $GIT_OBJECT_DIRECTORY 环境变量指定了对象存储目录，那么将在下面创建 sha1目录，否则将使用默认的 $GIT_DIR/objects 目录。

source: If the object storage directory is specified via this environment variable then the sha1 directories are created underneath - otherwise the default $GIT_DIR/objects directory is used.
zh_cn: 如果通过此环境变量指定了对象存储目录，那么将在下面创建 sha1 目录，否则将使用默认的 $GIT_DIR/objects 目录。

source: If the option --all or -a is given then all available commands are printed.
zh_cn: 如果给出选项 --all 或 -a ，则打印所有可用的命令。

source: If the option --all or -a is given, all available commands are printed on the standard output.
zh_cn: 如果给出选项 --all 或 -a ，则所有可用的命令都将打印在标准输出上。

source: If the option --guide or -g is given, a list of the useful Git guides is also printed on the standard output.
zh_cn: 如果给出了选项 --guide 或 -g ，那么在标准输出上也会列出有用的 Git 指南。

source: If the pattern does not contain a slash /, Git treats it as a shell glob pattern and checks for a match against the pathname relative to the location of the .gitignore file (relative to the toplevel of the work tree if not from a .gitignore file).
zh_cn: 如果模式不包含斜杠 / ，Git 将其视为 shell glob 模式，并检查相对于 .gitignore 文件的位置的匹配(如果不是来自 .gitignore 文件，则相对于工作树的顶级)。

source: If the pattern ends with a slash, it is removed for the purpose of the following description, but it would only find a match with a directory.
zh_cn: 如果模式以斜杠结尾，则为了以下描述的目的，它将被移除，但只能找到目录的匹配。

source: If the reference repository is on the local machine, automatically setup .git/objects/info/alternates to obtain objects from the reference repository.
zh_cn: 如果参考仓库在本地机器上，自动设置 .git/objects/info/alternates 以从参考存储库获取对象。

source: If the repository configuration file is not available or readable, git config will exit with a non-zero error code.
zh_cn: 如果仓库配置文件不可用或不可读，则 git config 将以非零错误代码退出。

source: If the repository is specified as a URL, then this flag is ignored (and we never use the local optimizations).
zh_cn: 如果仓库被指定为 URL，则该标志将被忽略(我们从不使用本地优化)。

source: If the repository is specified as a local path (e.g., /path/to/repo), this is the default, and --local is essentially a no-op.
zh_cn: 如果仓库被指定为本地路径(例如， /path/to/repo )，则这是默认值，而 --local 本质上是无操作的。

source: If the second number in a range is omitted, all remaining items are selected.
zh_cn: 如果省略范围中的第二个数字，则选择所有剩余的项目。

source: If the second number in a range is omitted, all remaining patches are taken.
zh_cn: 如果省略了范围中的第二个数字，则将采取所有剩余的补丁。

source: If the tag is not annotated, the commit message is displayed instead.
zh_cn: 如果标记未注释，则会显示提交消息。

source: If the tag points to the commit, then only the tag is shown.
zh_cn: 如果有标签指向提交，则只显示该标签。

source: If the upstream branch already contains a change you have made (e.g., because you mailed a patch which was applied upstream), then that commit will be skipped.
zh_cn: 如果上游分支已经包含您所做的更改(例如，因为邮寄了上游应用的补丁)，那么该提交将被跳过。

source: If the user exits the editor without editing the message, the commit is aborted.
zh_cn: 如果用户退出编辑器而不编辑消息，则提交将中止。

source: If the variable is set to an integer value greater than 2 and lower than 10 (strictly) then Git will interpret this value as an open file descriptor and will try to write the trace messages into this file descriptor.
zh_cn: 如果变量设置为大于2且小于10(严格)的整数值，则 Git 将将此值解释为打开的文件描述符，并尝试将跟踪消息写入此文件描述符。

source: If there is a remote-tracking branch corresponding to the upstream branch and the upstream branch was rebased since last fetched, the rebase uses that information to avoid rebasing non-local changes.
zh_cn: 如果存在与上游分支相对应的远程跟踪分支，并且上次分支自上次提取以来执行过变基，则变基使用该信息来避免变基非本地的更改。

source: If this environment variable is not set, Git will choose buffered or record-oriented flushing based on whether stdout appears to be redirected to a file or not.
zh_cn: 如果未设置此环境变量，则 Git 将根据是否将 stdout 显示为重定向到文件来选择缓冲或基于记录的刷新。

source: If this environment variable is set to "1", then commands such as git blame (in incremental mode), git rev-list, git log, git check-attr and git check-ignore will force a flush of the output stream after each record have been flushed.
zh_cn: 如果此环境变量设置为"1"，那么诸如 git blame (增量模式), git rev-list, git log, git check-attr and git check-ignore 将在每个记录被刷新后强制刷新输出流。

source: If this environment variable is set to 0, git will not prompt on the terminal (e.g., when asking for HTTP authentication).
zh_cn: 如果此环境变量设置为 0 ，git 将不会在终端上提示(例如，在要求 HTTP 认证时)。

source: If this environment variable is set, it overrides Git’s autodetection whether GIT_SSH/GIT_SSH_COMMAND/core.sshCommand refer to OpenSSH, plink or tortoiseplink.
zh_cn: 如果设置了此环境变量，它将覆盖 Git 的自动检测，无论 GIT_SSH / GIT_SSH_COMMAND / core.sshCommand 是指 OpenSSH，plink 或 tortoiseplink。

source: If this environment variable is set, then Git commands which need to acquire passwords or passphrases (e.g. for HTTP or IMAP authentication) will call this program with a suitable prompt as command-line argument and read the password from its STDOUT.
zh_cn: 如果设置了此环境变量，则需要获取密码或密码(例如 HTTP 或 IMAP 认证)的 Git 命令将使用合适的提示将该程序称为命令行参数，并从其 STDOUT 读取密码。

source: If this option is omitted, the current HEAD will be used instead.
zh_cn: 如果省略此选项，将使用当前 HEAD。

source: If this option is specified together with --amend, then no paths need to be specified, which can be used to amend the last commit without committing changes that have already been staged.
zh_cn: 如果此选项与 --amend 一起指定，则不需要指定任何路径，可以用于修改上一次提交而不提交已经暂存的更改。

source: If this variable is set to "0", the output of these commands will be done using completely buffered I/O.
zh_cn: 如果此变量设置为"0"，则这些命令的输出将使用完全缓冲的 I/O 完成。

source: If this variable is set to "1", "2" or "true" (comparison is case insensitive), trace messages will be printed to stderr.
zh_cn: 如果此变量设置为“1”，“2”或“true”(比较不区分大小写)，跟踪消息将打印到 stderr 。

source: If this variable is set to a path, non-worktree files that are normally in $GIT_DIR will be taken from this path instead.
zh_cn: 如果将此变量设置为路径，则通常在$GIT_DIR 中的非工作树文件将从该路径中取出。

source: If used together with --allow-empty paths are also not required, and an empty commit will be created.
zh_cn: 如果与 --allow-empty 路径一起使用也不是必需的，并且将创建一个空提交。

source: If we have the following situation:
zh_cn: 如果我们有以下情况：

source: If you are creating a branch that you want to checkout immediately, it is easier to use the git checkout command with its -b option to create a branch and check it out with a single command.
zh_cn: 如果要创建立即 checkout 的分支，则使用 -b 选项来使用 git checkout 命令，可以用单个命令更容易创建分支并检出它。

source: If you are currently not on any branch or if the current branch does not have a configured upstream, the rebase will abort.
zh_cn: 如果您当前不在任何分支上，或者如果当前分支没有配置上游，则 rebase 将中止。

source: If you are instead primarily interested in using Git to fetch a project, for example, to test the latest version, you may prefer to start with the first two chapters of The Git User’s Manual.
zh_cn: 如果您主要感兴趣的是使用 Git 获取项目，例如，要测试最新版本，您可能更喜欢从 The Git User’s Manual 的前两章开始。

source: If you do not supply this argument, the command reads from the standard input.
zh_cn: 如果不提供此参数，则该命令从标准输入读取。

source: If you have a clone of git.git itself, the output of git-shortlog[1] and git-blame[1] can show you the authors for specific parts of the project.
zh_cn: 如果您有 git.git 本身的克隆，则 git-shortlog[1] 和 git-blame[1] 的输出可以显示作者的特定部分。

source: If you have an unfortunate branch that is named hello.c, this step would be confused as an instruction to switch to that branch.
zh_cn: 如果你有一个不幸的分支，名为 hello.c ，这个步骤将被混淆为一个指令切换到该分支。

source: If you intend that your next commit should record all modifications of tracked files in the working tree and record all removals of files that have been removed from the working tree with rm (as opposed to git rm), use git commit -a, as it will automatically notice and record all removals.
zh_cn: 如果您希望下一个提交应记录工作树中的跟踪文件的所有修改的，并记录已从工作树中删除的文件的所有删除（ rm （而不是 git rm ），使用 git commit -a ，因为它会自动注意并记录所有删除。

source: If you know what you’re doing and all you want is to disable this behavior permanently without further considerations, just do:
zh_cn: 如果你知道你在做什么，而你所要做的就是永久性地禁用这个行为，不需要进一步的考虑，只要做：

source: If you make a commit and then find a mistake immediately after that, you can recover from it with git reset.
zh_cn: 如果您做出提交，然后立即发现错误，您可以使用 git reset 从中恢复。

source: If you specify no filters, the commits will be recommitted without any changes, which would normally have no effect.
zh_cn: 如果您不指定任何过滤器，则将重新提交提交，而不进行任何更改，通常不会有任何影响。

source: If you supply directories, they will be treated as Maildirs.
zh_cn: 如果您提供目录，它们将被视为 Maildirs。

source: If you tried a pull which resulted in complex conflicts and would want to start over, you can recover with git reset.
zh_cn: 如果您尝试一个拉取导致复杂的冲突，并希望重新开始，您可以使用 git reset 进行恢复。

source: If you want Git to expand file glob characters, you may need to shell-escape them.
zh_cn: 如果您希望 Git 扩展文件 glob 字符，则可能需要对其进行 shell-escape。

source: If you want to "completely forget" a file, it does not matter when it entered history, so we also add --ignore-unmatch:
zh_cn: 如果你想 "完全忘记" 一个文件，它何时进入历史记录不重要，那么我们还添加了 --ignore-unmatch ：

source: If you want to abort the operation entirely (i.e., stage nothing new in the index), simply delete all lines of the patch.
zh_cn: 如果要完全中止操作(即索引中没有新功能)，只需删除补丁的所有行。

source: If you want to check out all C source files out of the index, you can say
zh_cn: 如果你想从索引中检出 全部 C 源文件，你可以说

source: If you want to clone submodules shallowly, also pass --shallow-submodules.
zh_cn: 如果要轻松克隆子模块，还可以通过 --shallow-submodules 。

source: If you want to extract specific files as they were in another commit, you should see git-checkout[1], specifically the git checkout <commit> -- <filename> syntax.
zh_cn: 如果要提取特定文件，因为它们在另一个提交中，您应该查看 git-checkout[1] ，特别是 git checkout <commit> -- <filename> 句法。

source: If you want to handle the lines that do not match the regex, just prepend a single exclamation mark in front (see also EXAMPLES).
zh_cn: 如果要处理 不 匹配正则表达式的行，只需在前面添加一个感叹号(见 EXAMPLES )。

source: If you want to throw away all uncommitted changes in your working directory, you should see git-reset[1], particularly the --hard option.
zh_cn: 如果要丢弃工作目录中的所有未提交的更改，您应该查看 git-reset[1] ，特别是 --hard 选项。

source: If you want to undo a commit other than the latest on a branch, git-revert[1] is your friend.
zh_cn: 如果你想撤销一个分支上最新的提交，那么你的朋友就是 git-revert[1] 。

source: If you want to update or unset an option which can occur on multiple lines, a POSIX regexp value_regex needs to be given.
zh_cn: 如果要更新或取消设置可能出现多行的选项，则需要给出 POSIX 正则表达式 value_regex 。

source: If you work with other people, you will need commands listed in the Individual Developer (Participant) section as well.
zh_cn: 如果您与其他人合作，您还需要在 个人开发人员（参与者） 部分中列出的命令。

source: Ignored files reached by directory recursion or filename globbing performed by Git (quote your globs before the shell) will be silently ignored.
zh_cn: 由 Git(在 shell 之前引用 globs)执行的目录递归或文件名 globbing 所达到的忽略文件将被忽略。

source: Ignoring files
zh_cn: 忽略文件

source: Imitate git clone but track only selected branches
zh_cn: 模仿 git clone ，但只跟踪所选的分支

source: Implies --dry-run.
zh_cn: 暗示 --dry-run 。

source: Implies --single-branch unless --no-single-branch is given to fetch the histories near the tips of all branches.
zh_cn: 隐含 --single-branch ，除非 --no-single-branch 被提供以获取所有分支提示附近的历史记录。

source: Import an Arch repository into Git
zh_cn: 将 Arch 仓库导入 Git

source: Import from and submit to Perforce repositories
zh_cn: 从 Perforce 仓库导入及提交给 Perforce 仓库

source: Importing a new project
zh_cn: 导入新项目

source: Importing patches to a project
zh_cn: 将修补程序导入项目

source: In Git’s context, synonym for object name.
zh_cn: 在 Git 的上下文中， object name 的同义词。

source: In a non-bare repository, this is the branch that will be checked out.
zh_cn: 在非裸库中，这是将被检出的分支。

source: In a normal, non-corrupted repository, this does nothing.
zh_cn: 在正常的，未损坏的仓库中，这不做任何事情。

source: In addition to the names of files that have been changed, also show the textual changes that are staged to be committed (i.e., like the output of git diff --cached).
zh_cn: 除了已更改的文件的名称之外，还会显示已暂存要提交的文本更改(例如，如 git diff --cached 的输出)。

source: In addition to those found in .gitignore (per directory) and $GIT_DIR/info/exclude, also consider these patterns to be in the set of the ignore rules in effect.
zh_cn: 除了在 .gitignore(每个目录)和 $GIT_DIR/info/exclude 中找到的那些外，还将这些模式视为有效的忽略规则的集合。
